{
  "users": {
    "_model": "User",
    "homer": {
      "firstName": "Homer",
      "lastName": "Simpson",
      "email": "homer@simpson.com",
      "password": "secret"
    },
    "marge": {
      "firstName": "Marge",
      "lastName": "Simpson",
      "email": "marge@simpson.com",
      "password": "secret"
    },
    "bart": {
      "firstName": "Bart",
      "lastName": "Simpson",
      "email": "bart@simpson.com",
      "password": "secret"
    }
  },


  "regions": {
    "_model": "Regions",

    "North East": {
      "title": "North East",
      "geo": {
        "lat": 54.7,
        "long": -6.1412
      }
    },
    "East Coast": {
      "title": "East Coast",
      "geo": {
        "lat": 53.306,
        "long": -6.437
      }
    },
    "South Coast": {
      "title": "South Coast",
      "geo": {
        "lat": 51.851,
        "long": -8.184
      }
    },
    "North West": {
      "title": "North West",
      "geo": {
        "lat": 54.821,
        "long": -7.91
      }
    },
    "Mid West": {
      "title": "Mid West",
      "geo": {
        "lat": 53.574,
        "long": -9.382
      }
    }
  },

  "islands": {
    "_model": "Islands",

    "LoughFoyle": {
      "name": "Lough Foyle",
      "lat": 55.19369052,
      "long": -6.96442359,
      "description": "Embarkation The logical embarkation point for the outer regions of Lough Foyle is Magilligan Point, by the Martello Tower. Access is by the B202 past the prison and rifle range. Do not block roads. Park by the hotel. The whole region is a security area, frequently patrolled. Especially beware of the military zone on the beach immediately to the E of the point, Benone Beach, on which it’s better not to land (certainly not while firing is going on).",
      "costalZone": "The North East",
      "region": "->regions.North East",
      "creator":"->users.homer"
    },

    "PortStewart":{
      "name": "Portstewart",
      "lat": 55.18778894,
      "long": -6.72122191,
      "description": "The area behind Portstewart Strand to the W of the town is part golf course and part National Trust. There is fee-paying access to the NT section, where there are toilets and parking. There is a powerful rip each end of the strand. When the strand is dumping, it is better to launch off a slip at Portnahapple at C813-376, which is usable in most conditions, but be aware that access is difficult from car parks in the area.. The harbour at C815-386 can be difficult to enter or exit in heavy seas, with multi-directional reflected waves. The slip is exposed to surge. There is good parking and this is the access of choice in calm conditions. There is some interesting rock hopping locally, clapotis almost always and some small caves and a blowhole that performs well in good swell. The tide can run fast around Portstewart Point.",
      "costalZone": "The North East",
      "region": "->regions.North East",
      "creator":"->users.homer"
    },

    "Portrush":{
      "name": "Portrush",
      "lat": 55.20595449,
      "long": -6.65623781,
      "description": "Portrush West Bay is easily accessed under the railway line. The slipway in the harbour is awkward in swell, being quite close to the entrance and is quite busy. Consider using Portandoo Harbour at C857-412 instead, though the parking is a little more remote. There is also good parking at the W end of Curran Strand with parking at C863-406. Ramore Head is interesting exploring in calm conditions. Skerries Sound often kicks up and is best avoided by the inexperienced. The ebb sets up powerful standing waves. ",
      "costalZone": "The North East",
      "region": "->regions.North East",
      "creator":"->users.marge"
    },

    "PortrushtoPortballintrae":{
      "name": "Portrush to Portballintrae",
      "lat": 55.20595449,
      "long": -6.65623781,
      "description": "White Rocks Beach at C899-411 is accessible from the road and there are good toilet and day time parking facilities. Calm conditions are necessary as the surf can be quite powerful with large dumping waves in heavy seas. The rips are strong and the tide flows strongly just beyond the break line. The rips are easily read from above on the road. It is mainly cliffs eastwards to Portballintrae. There are a number of interesting caves in the first section along under prominent Dunluce Castle at C905-415. One such cave is directly under the castle. Exploration of some of the other caves hereabouts requires a torch. There is good rock hopping eastwards to Portballintrae, with at least one good sheltered deep water landing in a channel about the halfway mark. Another cave just W of Binbane Cove is 40 to 50<em>m</em> long. Beware of a choke point halfway in, where the surge can catch the unwary. In Portballintrae Harbour, there is a public slipway at C926-423. There are toilets and a car park which can become quite congested in summer. Local surfers prefer the larger car park at C930-424 overlooking Bushfoot Strand to the E of the town. Access to the beach is just W of the car park. Kayakers always prefer the harbour.",
      "costalZone": "The North East",
      "region": "->regions.North East",
      "creator":"->users.bart"
    },

    "Downhill": {
      "name": "Downhill",
      "lat": 55.16721802,
      "long": -6.81917323,
      "description": "There is public access at the extreme E end of Benone Beach at a point called Downhill Strand. The Downhill Hotel was closed and demolished.  An apartment block now fills the gap.  Parking and toilets are beside the apartments and access is by a stream through an archway under the railway.",
      "costalZone": "The North East",
      "region": "->regions.North East",
      "creator":"->users.bart"
    },
    "PortStewarttoPortrush": {
      "name": "Portstewart to Portrush",
      "lat": 55.18778894,
      "long": -6.72122191,
      "description": "The coastline here is basalt and reasonably interesting, low lying at first. Rinagree Point at C833-397 is the halfway point. To its W is Black Rock and just off it lies Lawson’s Rock, which breaks even in a moderate swell. It is possible to shelter in the lee of Black Rock. There is a tiny storm beach accessible from landward just E of Rinagree Point. Boomers may be expected hereabouts. Rock hopping and narrow channels are best enjoyed in calmer conditions and at about HW. Tides An eddy runs west on the flood tide between Ramore Head to the Bann Barmouth from 2 hours before Belfast HW. ",
      "costalZone": "The North East",
      "region": "->regions.North East",
      "creator":"->users.homer"
    },

    "PortballintraetoDunseerick":{
      "name": "Portballintrae to Dunseverick",
      "lat": 55.21988365,
      "long": -6.53948915,
      "description": "The rocks between the harbour and Bushfoot Strand can be fun at HW. On passage however, give them plenty of clearance. Stay at least 200<em>m</em> clear of the E harbour entrance to avoid a boomer called the Blind Rock. Bushfoot is named for the River Bush which flows in here at the SW corner. Upriver 2<em>km</em> is the town of Bushmills, famed globally for its Black Bush whiskey. The beach tends to surf and should be used with caution. After rain, a brown tongue of water enters the sea and what happens to it is a good guide to what the tide is doing just then. The E part of the beach is irregularly rocky and not a good place for small boats. There is a small slip below Runkerry House at C934-435. The coastline eastwards is the Giant’s Causeway section. It is committing and there are no easy landing places. It is also one of the most beautiful sections of the entire Northern Ireland coastline. Just SE of the off-lying rock, the Mile Stone at C934-440, is the massive and beautiful Runkerry Cave at C935-439, complete with boulder beach and long dry passage. There are other caves hereabouts, most notably in a small cove 0.5<em>km</em> E of Runkerry called locally Portcoon, with a dry side entrance. There is a slip in Portnaboe, the last cove before the Causeway proper. Visitors once walked from this point, before the access from above was organised. The Causeway section itself is 5<em>km</em> around Benbane Head (C965-461). There are many exposures of geological features; dykes, sills and the various layers of volcanic activity are easily seen. The Causeway itself and all the related geology are far better seen from seaward. In strong offshore winds there are vicious down draughts and each of the bays can funnel the wind to strong gusts. Formidable tides run off Benbane Head and great seas can build up off it and off Bengore Head 1<em>km</em> E. The Spanish Armada The tragedy of the <em>Girona</em>, wrecked at Lacada Point C952-455, was that it was the most seaworthy of several ships that sailed on 16<sup>th</sup> October 1588 from Killybegs for Scotland. 1300 were drowned, including members of most of the noblest families in Spain. The remains of the wreck were discovered c1967 by a team of divers and a great number of artifacts including many many trinkets and jewellery did survive in the cracks and crevices off the Point, as well as cannons, cannonballs and other memorabilia which are now in The Ulster Museum in Belfast. Port Moon Port Moon at C979-451 on the E side of Contham Head C978-4456 is a natural small boat harbour among low rocks at the base of a 60<em>m</em> cliff. A bothy with a rusty roof marks the spot to the passerby, as do the salmon net poles around it, when close in. The bothy is presently the subject of a renovation programme which should be finished by summer 2011. The gut is 100<em>m</em> by 8<em>m</em> and there are rings on either side for shorelines. The port enjoys 1.5<em>m</em> LWS at the outer end. Landing is possible onto a sheltered but rough and stony shore/slip. ",
      "costalZone": "The East Coast",
      "region": "->regions.East Coast",
      "creator":"->users.homer"
    },

    "RiverBann": {
      "name": "River Bann",
      "lat": 55.17124307,
      "long": -6.77197253,
      "description": "To the E of Castlerock village is the Bar Mouth, where the River Bann flows into the sea. Turbulent water can be experienced quite a distance offshore. The flood at the mouth is weak by comparison to the ebb. Especially when the river is up, the ebb and the flow of the river combine to produce mighty standing waves. The flow of the river is controlled by floodgates well upstream. Powerful rip currents either side of the mouth are dangerous enough. The mouth artificially narrows the stream and this projects the fresh water out with great force. The fresh water is easily distinguished in the sea water and gives a good guide as to tide direction and strength off the beaches. The river is marked as far up as Coleraine. The area is a noted birding spot in winter. ",
      "costalZone": "The North East",
      "region": "->regions.East Coast",
      "creator":"->users.homer"
    },

    "LittleSalteeIsland":{
      "name": "Little Saltee Island",
      "lat": 52.14031776,
      "long": -6.58976231,
      "description": "This island is less frequented than its better-known and more interesting neighbour. Historically, 3 people or so lived on Little Saltee until the mid-19th Century, when rumour insists it was connected to the mainland. Little Saltee was farmed until World War 2. The farm speciality was early-season new potatoes, but corn and other vegetables were also grown. 12 people were needed at harvest time. A thresher was brought over, in parts, in small boats. The island was abandoned and overgrown until recently. Since 1999, the owners now farm pedigree Kerry cows, fallow deer,  and since 2003 Soay sheep, from the Scottish island of same name, just S of Skye, well known to climbers. The main house and some of its outbuildings have been made habitable. The courtyard has been tidied. There is a fine ruin of a two-storey barn and interesting remains of corn stands in the yard immediately W of the main building. There are the remains of an old well within the courtyard but it did not hold water in April 2003 and appeared long disused.",
      "costalZone": "The South Coast",
      "region": "->regions.South Coast",
      "creator":"->users.marge"
    },


    "Great Saltee Island":{
      "name": "Great Saltee Island",
      "lat": 52.12079534,
      "long": -6.61081916,
      "description": "This is a beautiful island. Grazed and easily walked or camped on, this island is lovely and deservedly popular with Irish paddlers. The island is a famed bird-watching spot, and is often inhabited by birding visitors in season, mainly spring and autumn. Once inhabited by 20 people, the island became uninhabited relatively early by Irish island standards. There are monuments and references to Prince Michael of Saltee on the island. He bought the island in 1943, crowned himself Prince in 1972, and died in 1998. Renewed interest in the island by his extended family has resulted in some of the scrub being removed around the remains of the old rick yard and the corn stands are more clearly visible. Landing Land at X952-974 on the N side, E of the middle. The main landing area has recently been improved with a channel having been cleared through the boulder beach, which in June 2003 gave a welcome sandy strip even at the lower stages of the tide. There are steps above to a house in trees. This landing is sheltered in most conditions. Privacy Predictably, members of the family are almost certainly in residence in August, long weekends, or periods of settled good weather. The tradition of flying the Prince of Saltee flag from the flagpole above the landing when the family are in residence has been renewed.",
      "costalZone": "The South Coast",
      "region": "->regions.South Coast",
      "creator":"->users.bart"
    },

    "Keeragh Islands":{
    "name": "Keeragh Islands",
    "lat": 52.19857617,
    "long": -6.73417805,
    "description": "These two islets lie in Ballyteige Bay, 12<em>km</em> W of the Saltees, relatively close inshore. They are small low-lying Birdwatch Ireland bird reserves. There are two distinct islands, but they are always regarded as the one. Landing is awkwardly practical at the N tip of each island, on either side of a projecting spit. On the bigger, northern island, there is an easy beachlet in a cut at the SW, facing the smaller island. Approach from the beach at Cullenstown at S869-077, 2<em>km</em> to the NNE. Stay away in spring and early summer, as nests are too numerous to avoid. The ruin on the larger island was built in 1800 for survivors of shipwrecks, but is now dilapidated. There is still a sealed box inside with what looks like electricity going into it, suggesting a phone? SPA Arctic Tern",
    "costalZone": "The South Coast",
    "region": "->regions.South Coast",
    "creator":"->users.homer"
  },
    "Hook Pennisula":{
      "name": "Hook Penninsula",
      "lat": 52.12322973,
      "long": -6.9305066,
      "description": "Hook Head is a popular kayaking and scuba diving area based on the main town Fethard.  A very attractive area, there is almost always sheltered sea-going hereabouts, almost regardless of wind direction.  Beloved of divers, there is always calm water somewhere for the training of beginners. Out at the Head there are arches and blowholes, caves and wrecks, and clear shallow water mostly.  The extensive sand beaches at Duncannon and Fethard contrast with the rocky cliffs by the Head itself.  Across Waterford Harbour lies the beautiful fishing and tourist village of Dunmore East, to which excursions may be made, landing at the pier, which was the first ever built by Nimmo. Early History The early history of the Hook mirrors the early history of Ireland generally.  The rocks locally are all sedimentary, limestones from 510,000,000 BP at the tip, then sandstones mudstones and siltstones progressively northwards.  Below Wood Village one can see the four post-ice age strata, a wave cut platform of former shoreline cut in folded siltstones, fossil raised beach, overlying mass of earth called “head”, and on top material called “till”, debris deposited by melting ice sheets 10,000 BP.  Ptolemy’s map of Ireland 100+AD recognised the Barrow River (called “<em>Birgos</em>”) and appears to recognise Baginbun Head as a promontory fort known to the locals as <em>Dún Domhnaill</em>.  There were 45 ring forts once, built 600 – 900 AD, with 13 surviving.  These are now accepted as “one off” farmsteads and not specifically military.",
      "costalZone": "The South Coast",
      "region": "->regions.South Coast",
      "creator":"->users.homer"
    },

    "Black Rock":{
      "name": "Black Rock",
      "lat": 54.30810138,
      "long": -8.61832983,
      "description": "Deadman’s Point, this is a major lighthouse on a minor piece of rock. While there has been a beacon on Black Rock since the 18th Century, the current lighthouse was designed by George Halpin Senior and was established in 1835. The light is 24m above sea level and flashes once every 5 seconds. It was automated in 1934. Intriguingly, the stairs to half height are up the outside, a feature unique among Irish lighthouses. The reason is that the initial design was for a beacon.  Later they built upwards, but the first 12m was solid, and they couldn’t cure that.  So the door is at half height and the stairs outside. Land E of the lighthouse, N or S sides, conditions dependent.  In either case the landing is onto boulders in rocky but sheltered harbourlets.  That on the S side is bounded by very visible raised walls.",
      "costalZone": "The North-West",
      "region": "->regions.North West",
      "creator":"->users.homer"
    },

    "Coney Island":{
      "name": "Coney Island",
      "lat": 54.29653919,
      "long": -8.59511879,
      "description": "SW of Deadman’s Point, this is an attractive, low-lying and varied island with a truly remote feel. It is reachable by car with difficulty from the mainland to the SE. If driving, leave the mainland 1<em>km</em> off the Sligo/Strandhill Road at G641-369. Posts mark the roadway across 3<em>km</em> of sand. Do not attempt to drive closer than +/- 0230HW locally, which is Galway +0040. If circumnavigating by kayak (strictly top of the tide) the passage is between the 3rd and 4th posts from the island. Landing Land easiest at a pier in a small bay at G623-394 facing the mainland and Oyster Island, just N of Wards Pub at G623-391. For kayakers, the nicest aspect of the island is the W-facing beach mid-W side. Camping is possible at the N end of this beach in a lay-by at the end of the island road. Dunes cover the S end of the island. Beware of the seas off this beach which can be dangerous. Fauna Coney badgers have white noses.  Many rabbit. Mink.  Rock Pipit.  Dunlin. Of the four islands called Coney Island in Ireland, this is the one that gave its name to Coney Island in New York.  Sligoman captain Peter O’Connor plied the Atlantic aboard the <em>Arethusa</em> 240 years ago, and named the now better known American version after his homeplace.",
      "costalZone": "The North-West",
      "region": "->regions.North West",
      "creator":"->users.marge"
    },

    "Maguins Island":{
      "name": "Maguins Island",
      "lat": 54.29557968,
      "long": -8.60739157,
      "description": "A piece of sand and dune separated equally from the Strandhill side to the S (beyond Sligo Airport) and Coney (the beautiful W beach on) to the N.  Lacking any obvious merit, Maguins may be waded to from either side at LW.  A rocky reef runs NE and S from the W tip, barring entrance except at higher waters.  Nettles, no camping found.",
      "costalZone": "**The North-West**",
      "region": "->regions.North West",
      "creator":"->users.homer"
    },

    "Island":{
      "name": "Island",
      "lat": 54.30206219,
      "long": -8.56754917,
      "description": "SE of Deadman’s Point, this is a privately owned residential farmland, semi-grazed by horses, and by hares. Oyster is nationally important as a supplier of wild hares to the Irish greyhound industry.  Sold in 2013, we hope there are no unforeseen changes to a lovely island.  It is possible to land just about anywhere. Limekiln on S side. No suitable camping found. The small lighthouse is a rear leading light which, in combination with the Metal Man light, guides ships into the channel.  2 Corncrake were calling in 2010.",
      "costalZone": "The North-West",
      "region": "->regions.North West",
      "creator":"->users.bart"
    },

    "Carrig Island":{
      "name": "Carrig Island",
      "lat": 52.57946585,
      "long": -9.50984344,
      "description": "The S/SW side of the island is joined to the mainland by a small bridge and a spit of marshy, grassy land, covered only by high spring tides. Carrig also has an inhabited farm and a Napoleonic battery at Q977-486 on the NW. The population is 13. The major attraction is the well-preserved Carrigafoyle Castle on the SE. The castle is more accessible from the water. Land at HW to avoid mud flats. The castle is a most interesting waystop, not to be missed by the passer-by. Thought to have been impregnable by 16<sup>th</sup> Century standards, and in 1580 Lord Pelham wasn’t convinced, and he was proved right. Military design quickly moved towards curved walls as a result. <strong>County Limerick",
      "costalZone": "The Mid-West",
      "region": "->regions.Mid West",
      "creator":"->users.homer"
    },

    "Foynes Island":{
      "name": "Foynes Island",
      "lat": 62.61535948,
      "long": -9.1080081,
      "description": "Foynes is the Anglicisation of <em>Oileán Fáinghe</em> in Irish, meaning “circular island”. It is well named, the island being very round. The island is situated 100m off Foynes village on the main coast road Limerick to Listowel. Historic In the days of amphibious planes, Foynes was the centre of the aviation world hereabouts. Being just about as far west in Europe as it is possible to be, that was important in those days. Planes from all over Europe stopped here to begin or end the Atlantic jump. Shannon Airport just across the estuary now fills the role of international airport to the west of Ireland, but with modern aircraft able to fly much longer distances, its role isn’t quite as critical. Its very long runway will always deserve it a role as a hub for certain long-haul airflights. Commercial foresters will find Foynes Island interesting, but others won’t be so turned on. It is a lumpy square kilometre of deciduous and coniferous trees. The interior is essentially impenetrable and holds little of interest to passing leisure craft. Land The main landing is at a pontoon at the S tip called Barneen Point, opposite the public harbour in the village. This gives access to the few houses on the island and should be considered private. The entire of the rest of the shoreline is accessible at HW but a sea of mud at lower waters. The mud is fine glutinous silt, most unpleasant. Whether extending a handful of metres or one hundred, landing onto it isn’t an option. Access can be conveniently achieved at only one other spot, halfway along the SW side at R245-523.",
      "costalZone": "The Mid-West",
      "region": "->regions.Mid West",
      "creator":"->users.homer"
    },

    "Inishmurry":{
      "name": "Inishmurry",
      "lat": 52.65132463,
      "long": -9.10596166,
      "description": "Sheet 64 A bitter acid-boggy island, a place of reeds and rushes and Yellow Flag. There are some Hawthorn. Outside on the SE shore, oysters and mussels grow wild. Its main merit is to serve as a shelter for Cahiracon Pier inside it on the mainland, now much abused.</p>\n",
      "costalZone": "The Mid-West",
      "region": "->regions.Mid West",
      "creator":"->users.homer"
    },

    "Inishtubbrid":{
      "name": "Inishtubbrid",
      "lat": 52.66606523,
      "long": -9.06642438,
      "description": "Smallest of the five larger islands at less than half a square kilometre, it is farmed with cattle. The summit has exposed limestone <em>karst</em>, Burrenesque in an untidy ragged way. Good views N from its lofty summit. Land at the SE for that mud/rock compromise common locally.",
      "costalZone": "The Mid-West",
      "region": "->regions.Mid West",
      "creator":"->users.homer"
    },

    "Canon Island":{
      "name": "**Canon Island**",
      "lat": 52.66975163,
      "long": -9.0561664,
      "description": "Fourth largest island hereabouts, Canon is cattle farmed. It is nearly split in two, being joined by an area of marshy reeds at its narrow waist. The interior of each sector is very wooded, and would need local knowledge to explore. There is an abandoned farmhouse by the landing spot which is at the usual mud / rock compromise at the S end of the W “beach”. There is a square tower at the NE end, with an Augustinian friary ruined beside it.n",
      "costalZone": "The Mid-West",
      "region": "->regions.Mid West",
      "creator":"->users.bart"
    },

    "Inishloe":{
      "name": "**Inishloe**",
      "lat": 52.67998344,
      "long": -9.01649131,
      "description": "Low lying, small fields, overgrown woods, cattle, extremely muddy all round.",
      "costalZone": "The Mid-West",
      "region": "->regions.Mid West",
      "creator":"->users.homer"
    },

    "Blackthorn Islands":{
      "name": "**Blackthorn Islands**",
      "lat": 52.67831233,
      "long": -9.00166725,
      "description": "Very attractive very low lying small triangular islet being a single field of about 3ha.  The most significant feature is the 19c dyke built of limestone blocks with no cement all round, to stave off the flooding.  The cost benefit analysis at the time must have been interesting.  Because it is in the path, almost, of the main flow, the shingle beaches on the N side are relatively mud free.",
      "costalZone": "The Mid-West",
      "region": "->regions.Mid West",
      "creator":"->users.marge"

    }
  }

}